app/views/devise/registrations/new.html.erb

<div class="field">
	  <%= f.hidden_field :s_num, value: Student.all.size%>
---
SELECT COUNT(*) FROM "students"

	<%= f.label "학과" %><br />
	<%= f.collection_select :department_id, Department.all, :id, :dep_name %>
---
SELECT "departments".* FROM "departments"