app/views/class_lists/_form.html.erb

SELECT "departments".* FROM "departments"
---
    <%= form.label :department_id %>
    <%= form.collection_select :department_id, Department.all, :id, :dep_name %>

SELECT "professors".* FROM "professors"
---
    <%= form.label :professor_id %>
    <%= form.collection_select :professor_id, Professor.all, :id, :pro_name%>