app/views/class_lists/index.html.erb

SELECT "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."student_id" = $1 AND "class_statuses"."status" = $2  [["student_id", 2], ["status", "신청"]]
---
			  <tr>
				  <%@my_completion_class = ClassStatus.where(student_id: current_student.id, status: "수료")%>

SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]
---
				<% end %></td>
				<td><%= ClassStatus.where(class_list_id: class_list.class_list.id).size %> / <%= class_list.class_list.limit_num %></td>

SELECT "class_lists".* FROM "class_lists"
---
						<% @my_class_lists.each do |apply_class| %>
							<% if apply_class.class_list.lecture_time.include? m %>