app/views/class_lists/index.html.erb

SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]
---
        <td><%= class_list.lecture_time %></td>
        <td><%= ClassStatus.where(class_list_id: class_list.id).size %> / <%= class_list.limit_num %></td>