app/views/professors/_form.html.erb

    <%= form.label :department_id %>
    <%= form.collection_select :department_id, Department.all, :id, :dep_name %>
---
SELECT "departments".* FROM "departments"