app/controllers/class_statuses_controller.rb

  def index
    @class_statuses = ClassStatus.all
---
SELECT "class_statuses".* FROM "class_statuses"

  def create
    @class_status = ClassStatus.new(class_status_params)

		respond_to do |format|
			if @class_status.overlap?
				format.html {redirect_to root_path, notice: "중복신청은 되지 않습니다."}
			elsif @class_status.full?
				@class_status.status = "대기"
				@class_status.save
				format.html { redirect_to root_path, notice: "강의인원이 초과되어 강의 대기 상태로 전환되었습니다." }
			else @class_status.save
---
INSERT INTO "class_statuses" ("status", "student_id", "class_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", nil], ["student_id", 3], ["class_list_id", 3], ["created_at", "2022-11-20 07:20:48.208085"], ["updated_at", "2022-11-20 07:20:48.208085"]]
INSERT INTO "class_statuses" ("status", "student_id", "class_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", "예약"], ["student_id", 2], ["class_list_id", 2], ["created_at", "2022-11-24 04:05:41.934961"], ["updated_at", "2022-11-24 04:05:41.934961"]]

  def update
    respond_to do |format|
      if @class_status.update(class_status_params)
---
UPDATE "class_statuses" SET "status" = $1, "updated_at" = $2 WHERE "class_statuses"."id" = $3  [["status", "신청"], ["updated_at", "2022-11-24 03:49:37.619845"], ["id", 75]]

  def destroy
    @class_status.destroy

    respond_to do |format|
      format.html { redirect_to root_path, notice: "강의신청이 취소되었습니다." }
      format.json { head :no_content }
    end
	  ClassStatus.all.each do |class_status|
		  @waiting_class_list = ClassStatus.where(class_list_id: class_status.class_list_id, status: "대기")
		  if class_status.empty?
			  @waiting_class_list.each do |class_list|
---
DELETE FROM "class_statuses" WHERE "class_statuses"."id" = $1  [["id", 5]]
SELECT "class_statuses".* FROM "class_statuses"
SELECT "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1 AND "class_statuses"."status" = $2  [["class_list_id", 1], ["status", "대기"]]
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1 AND "class_statuses"."status" = $2  [["class_list_id", 1], ["status", "신청"]]
SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def set_class_status
      @class_status = ClassStatus.find(params[:id])
---
SELECT  "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]