app/controllers/class_lists_controller.rb

SELECT "class_lists".* FROM "class_lists"
SELECT "class_statuses"."id" FROM "class_statuses" WHERE "class_statuses"."student_id" = $1 AND "class_statuses"."status" = $2  [["student_id", 2], ["status", "예약"]]
---
  def index
    @class_lists = ClassList.all
	@my_class_lists = ClassStatus.where(student_id: current_student.id, status: "신청")

INSERT INTO "class_lists" ("c_name", "credit", "classify", "sub_type", "sub_num", "target_grade", "limit_num", "lecture_time", "department_id", "professor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @class_list = ClassList.new(class_list_params)

    respond_to do |format|
      if @class_list.save

SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_class_list
      @class_list = ClassList.find(params[:id])