app/controllers/class_statuses_controller.rb

  def update
    respond_to do |format|
      if @class_status.update(class_status_params)
---
UPDATE "class_statuses" SET "status" = $1, "updated_at" = $2 WHERE "class_statuses"."id" = $3  [["status", "신청"], ["updated_at", "2022-11-22 05:21:48.205934"], ["id", 18]]