app/controllers/professors_controller.rb

INSERT INTO "professors" ("pro_name", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pro_name", "김화선"], ["department_id", 1], ["created_at", "2022-11-20 04:52:10.586968"], ["updated_at", "2022-11-20 04:52:10.586968"]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save