app/models/class_status.rb

	def overlap?
		ClassStatus.where(student_id: self.student_id, class_list_id: self.class_list_id, status: "신청").size > 0
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."student_id" = $1 AND "class_statuses"."class_list_id" = $2  [["student_id", 3], ["class_list_id", 3]]

	def full?
		ClassStatus.where(class_list_id: self.class_list_id, status: "신청").size >= ClassList.find(self.class_list_id).limit_num
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1 AND "class_statuses"."status" = $2  [["class_list_id", 4], ["status", "신청"]]

	def empty?
		ClassStatus.where(class_list_id: self.class_list_id, status: "신청").size < ClassList.find(self.class_list_id).limit_num
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1 AND "class_statuses"."status" = $2  [["class_list_id", 1], ["status", "신청"]]

	def retake?
		@retake = ClassStatus.where(student_id: self.student_id, class_list_id: self.class_list_id)
		@retake.each do |retake|
---
SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]